app/controllers/locpairs_controller.rb

SELECT  "locpairs".* FROM "locpairs" WHERE "locpairs"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@locpair = Locpair.find(params[:id])

INSERT INTO "locpairs" ("location1", "location2", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location1", "f"], ["location2", "a"], ["created_at", "2016-05-16 19:59:35.453915"], ["updated_at", "2016-05-16 19:59:35.453915"]]
---
	def create
#		render plain: params[:locpair].inspect
		@locpair = Locpair.new(locpair_params)

		@locpair.save